# Renaming Columns

In [1]:
import pandas as pd

In [17]:
df = pd.read_csv('people_data.csv')

df

   first      last  age  height_cm  weight_kg income
0  James     Smith   18      175.7       66.9  1,000
1   Jane    Watson   18      163.0       56.7    800
2   Adam    Miller   19      176.5       68.9    350
3   Sara  Thompson   19      163.3       58.0    980
4    Tom     Piper   20      168.5       57.5  2,500
5  Carol   Winters   20      177.5       63.4  2,950

### Check column names

In [3]:
df.columns

Index(['first', 'last', 'age', 'height_cm', 'weight_kg', 'income'], dtype='object')

### Rename by supplying column list

In [4]:
col_names = ['first_name', 'last_name', 'respondent_age', 'height', 'weight', 'income']

In [5]:
df.columns = col_names

df.head()

  first_name last_name  respondent_age  height  weight income
0      James     Smith              18    75.7    66.9  1,000
1       Jane    Watson              18   163.0    56.7    800
2       Adam    Miller              19   176.5    68.9    350
3       Sara  Thompson              19   163.3    58.0    980
4        Tom     Piper              20   168.5    57.5  2,500

### Rename with a dictionary

- This method allows you to only rename a few columns.
- Suply a dict with column old and new names

In [7]:
df.rename(columns = {'first_name': 'firstname', 'last_name': 'surname', 
                    'respondent_age': 'age'}, inplace=True)

df.head()

  firstname   surname  age  height  weight income
0     James     Smith   18    75.7    66.9  1,000
1      Jane    Watson   18   163.0    56.7    800
2      Adam    Miller   19   176.5    68.9    350
3      Sara  Thompson   19   163.3    58.0    980
4       Tom     Piper   20   168.5    57.5  2,500